app/Views/mhs/krs/v_krs.php

                    <?php $no = 1;
                    $db = \Config\Database::connect();
                    foreach ($matkul_ditawarkan as $key => $value) {
                      $jml = $db->table('tbl_krs')
                ->where('id_jadwal', $value['id_jadwal'])
                ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_krs`
WHERE `id_jadwal` = '8'