app/Models/ModelAuth.php

    public function login_mhs($username, $password)
    {
        return $this->db->table('tbl_mhs')->where([
            'nim' => $username,
            'password' => $password
        ])->get()->getRowArray();
---
SELECT *
FROM `tbl_mhs`
WHERE `nim` = '18220183'
AND `password` = '1234'